caominhtri070105/STM32LAB1/LAB1_Exercise/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define S_RED_LED_Pin GPIO_PIN_0
#define S_RED_LED_GPIO_Port GPIOA
#define S_YELLOW_LED_Pin GPIO_PIN_1
#define S_YELLOW_LED_GPIO_Port GPIOA
#define S_GREEN_LED_Pin GPIO_PIN_2
#define S_GREEN_LED_GPIO_Port GPIOA
#define W_RED_LED_Pin GPIO_PIN_5
#define W_RED_LED_GPIO_Port GPIOA
#define W_YELLOW_LED_Pin GPIO_PIN_6
#define W_YELLOW_LED_GPIO_Port GPIOA
#define W_GREEN_LED_Pin GPIO_PIN_7
#define W_GREEN_LED_GPIO_Port GPIOA
#define E_RED_LED_Pin GPIO_PIN_8
#define E_RED_LED_GPIO_Port GPIOA
#define E_YELLOW_LED_Pin GPIO_PIN_9
#define E_YELLOW_LED_GPIO_Port GPIOA
#define E_GREEN_LED_Pin GPIO_PIN_10
#define E_GREEN_LED_GPIO_Port GPIOA
#define N_RED_LED_Pin GPIO_PIN_11
#define N_RED_LED_GPIO_Port GPIOA
#define N_YELLOW_LED_Pin GPIO_PIN_12
#define N_YELLOW_LED_GPIO_Port GPIOA
#define N_GREEN_LED_Pin GPIO_PIN_13
#define N_GREEN_LED_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
